In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [2]:
index = ['a', 'b', 'c', 'd', 'e']
s = Series(np.arange(5), index=index)
print(s)
print(s.index)

a    0
b    1
c    2
d    3
e    4
dtype: int64
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [3]:
s * s

a     0
b     1
c     4
d     9
e    16
dtype: int64

In [4]:
s * 2

a    0
b    2
c    4
d    6
e    8
dtype: int64

In [5]:
s[2:4]

c    2
d    3
dtype: int64

In [6]:
s['b']

1

In [7]:
s['b':]

b    1
c    2
d    3
e    4
dtype: int64

In [8]:
s[[0,2,3]]

a    0
c    2
d    3
dtype: int64

In [9]:
s[['b','d']]

b    1
d    3
dtype: int64

In [10]:
dates = pd.date_range('2007-07-16', '2007-07-21')
atemps = Series([100.23, 98.23, 78.98, 103.21, 87.23, 97.56], index=dates)
atemps

2007-07-16    100.23
2007-07-17     98.23
2007-07-18     78.98
2007-07-19    103.21
2007-07-20     87.23
2007-07-21     97.56
Freq: D, dtype: float64

In [11]:
idx = atemps.index[2]

In [12]:
atemps[idx]

78.980000000000004

In [13]:
sdtemps = Series([76.23, 67.56, 87.23, 67.65, 91.54, 86.98], index=dates)
temps = DataFrame({'Austin': atemps, 'Sandiago': sdtemps})
temps

            Austin  Sandiago
2007-07-16  100.23     76.23
2007-07-17   98.23     67.56
2007-07-18   78.98     87.23
2007-07-19  103.21     67.65
2007-07-20   87.23     91.54
2007-07-21   97.56     86.98

In [14]:
# refer a column
temps['Austin']

2007-07-16    100.23
2007-07-17     98.23
2007-07-18     78.98
2007-07-19    103.21
2007-07-20     87.23
2007-07-21     97.56
Freq: D, Name: Austin, dtype: float64

In [15]:
# columns can be referred as attribute
temps.Sandiago

2007-07-16    76.23
2007-07-17    67.56
2007-07-18    87.23
2007-07-19    67.65
2007-07-20    91.54
2007-07-21    86.98
Freq: D, Name: Sandiago, dtype: float64

In [16]:
# columns can be subtracted:
temps.Austin - temps.Sandiago

2007-07-16    24.00
2007-07-17    30.67
2007-07-18    -8.25
2007-07-19    35.56
2007-07-20    -4.31
2007-07-21    10.58
Freq: D, dtype: float64

In [18]:
# select a row
temps.ix[2]

Austin      78.98
Sandiago    87.23
Name: 2007-07-18 00:00:00, dtype: float64

In [21]:
# select a row and a column
temps.ix[2:4].Austin

2007-07-18     78.98
2007-07-19    103.21
Freq: D, Name: Austin, dtype: float64

In [23]:
# select a row and a column
temps.ix[2:4, 'Austin']

2007-07-18     78.98
2007-07-19    103.21
Freq: D, Name: Austin, dtype: float64

In [28]:
# column means and medians
temps.mean()

Austin      94.240000
Sandiago    79.531667
dtype: float64

In [27]:
temps.median()

Austin      97.895
Sandiago    81.605
dtype: float64

In [29]:
temps - temps.mean()

            Austin   Sandiago
2007-07-16    5.99  -3.301667
2007-07-17    3.99 -11.971667
2007-07-18  -15.26   7.698333
2007-07-19    8.97 -11.881667
2007-07-20   -7.01  12.008333
2007-07-21    3.32   7.448333

In [30]:
# select subsets
temps[temps.Austin > 100]

            Austin  Sandiago
2007-07-16  100.23     76.23
2007-07-19  103.21     67.65

In [33]:
# read csv
pd.read_csv('data/test1.csv')

                  date         0         1         2         3
0  2000-01-01 00:00:00  1.103763 -1.909979 -0.808956 -2.392629
1  2000-01-02 00:00:00  1.188917  0.581120  0.861597 -0.213885
2  2000-01-03 00:00:00 -0.964200  0.779764  1.829062  0.322422
3  2000-01-04 00:00:00  0.782130 -1.720670 -1.108242  1.233489
4  2000-01-05 00:00:00 -1.867017 -0.528368 -2.488309  1.480342
5  2000-01-06 00:00:00  2.569280 -0.471901 -0.835033 -0.532133
6  2000-01-07 00:00:00 -0.399323 -0.676427 -0.011256  0.223252
7  2000-01-08 00:00:00  1.642993  1.013420  1.435667 -0.635862
8  2000-01-09 00:00:00  1.147308  2.138000  0.554171 -0.255538
9  2000-01-10 00:00:00  0.933766  1.387155 -0.560143 -0.787083

In [40]:
df2 = pd.read_csv('data/test1.csv', parse_dates=['date'])
df2

        date         0         1         2         3
0 2000-01-01  1.103763 -1.909979 -0.808956 -2.392629
1 2000-01-02  1.188917  0.581120  0.861597 -0.213885
2 2000-01-03 -0.964200  0.779764  1.829062  0.322422
3 2000-01-04  0.782130 -1.720670 -1.108242  1.233489
4 2000-01-05 -1.867017 -0.528368 -2.488309  1.480342
5 2000-01-06  2.569280 -0.471901 -0.835033 -0.532133
6 2000-01-07 -0.399323 -0.676427 -0.011256  0.223252
7 2000-01-08  1.642993  1.013420  1.435667 -0.635862
8 2000-01-09  1.147308  2.138000  0.554171 -0.255538
9 2000-01-10  0.933766  1.387155 -0.560143 -0.787083

In [41]:
df2.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [36]:
df2.date[1]

Timestamp('2000-01-02 00:00:00')

In [42]:
# specify date as index column to make it a time series
df2 = pd.read_csv('data/test1.csv', parse_dates=['date'], index_col='date')
df2

                   0         1         2         3
date
2000-01-01  1.103763 -1.909979 -0.808956 -2.392629
2000-01-02  1.188917  0.581120  0.861597 -0.213885
2000-01-03 -0.964200  0.779764  1.829062  0.322422
2000-01-04  0.782130 -1.720670 -1.108242  1.233489
2000-01-05 -1.867017 -0.528368 -2.488309  1.480342
2000-01-06  2.569280 -0.471901 -0.835033 -0.532133
2000-01-07 -0.399323 -0.676427 -0.011256  0.223252
2000-01-08  1.642993  1.013420  1.435667 -0.635862
2000-01-09  1.147308  2.138000  0.554171 -0.255538
2000-01-10  0.933766  1.387155 -0.560143 -0.787083

In [43]:
df2.index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10'],
              dtype='datetime64[ns]', name='date', freq=None)

In [44]:
# specify date as index column to make it a time series
df2 = pd.read_csv('data/test1.csv', parse_dates=['date'])
df3 = df2.set_index('date', drop=False)
df3

                 date         0         1         2         3
date
2000-01-01 2000-01-01  1.103763 -1.909979 -0.808956 -2.392629
2000-01-02 2000-01-02  1.188917  0.581120  0.861597 -0.213885
2000-01-03 2000-01-03 -0.964200  0.779764  1.829062  0.322422
2000-01-04 2000-01-04  0.782130 -1.720670 -1.108242  1.233489
2000-01-05 2000-01-05 -1.867017 -0.528368 -2.488309  1.480342
2000-01-06 2000-01-06  2.569280 -0.471901 -0.835033 -0.532133
2000-01-07 2000-01-07 -0.399323 -0.676427 -0.011256  0.223252
2000-01-08 2000-01-08  1.642993  1.013420  1.435667 -0.635862
2000-01-09 2000-01-09  1.147308  2.138000  0.554171 -0.255538
2000-01-10 2000-01-10  0.933766  1.387155 -0.560143 -0.787083

In [45]:
pd.read_csv('data/test2.csv')

         date         0         1         2         3      time
0  2000-01-01  1.103763 -1.909979 -0.808956 -2.392629  00:00:00
1  2000-01-02  1.188917  0.581120  0.861597 -0.213885  00:00:00
2  2000-01-03 -0.964200  0.779764  1.829062  0.322422  00:00:00
3  2000-01-04  0.782130 -1.720670 -1.108242  1.233489  00:00:00
4  2000-01-05 -1.867017 -0.528368 -2.488309  1.480342  00:00:00
5  2000-01-06  2.569280 -0.471901 -0.835033 -0.532133  00:00:00
6  2000-01-07 -0.399323 -0.676427 -0.011256  0.223252  00:00:00
7  2000-01-08  1.642993  1.013420  1.435667 -0.635862  00:00:00
8  2000-01-09  1.147308  2.138000  0.554171 -0.255538  00:00:00
9  2000-01-10  0.933766  1.387155 -0.560143 -0.787083  00:00:00

In [47]:
pd.read_csv('data/test2.csv', parse_dates=[['date', 'time']])

   date_time         0         1         2         3
0 2000-01-01  1.103763 -1.909979 -0.808956 -2.392629
1 2000-01-02  1.188917  0.581120  0.861597 -0.213885
2 2000-01-03 -0.964200  0.779764  1.829062  0.322422
3 2000-01-04  0.782130 -1.720670 -1.108242  1.233489
4 2000-01-05 -1.867017 -0.528368 -2.488309  1.480342
5 2000-01-06  2.569280 -0.471901 -0.835033 -0.532133
6 2000-01-07 -0.399323 -0.676427 -0.011256  0.223252
7 2000-01-08  1.642993  1.013420  1.435667 -0.635862
8 2000-01-09  1.147308  2.138000  0.554171 -0.255538
9 2000-01-10  0.933766  1.387155 -0.560143 -0.787083

In [48]:
pd.read_csv('data/test2.csv', parse_dates=[['date', 'time']], index_col='date_time')

                   0         1         2         3
date_time
2000-01-01  1.103763 -1.909979 -0.808956 -2.392629
2000-01-02  1.188917  0.581120  0.861597 -0.213885
2000-01-03 -0.964200  0.779764  1.829062  0.322422
2000-01-04  0.782130 -1.720670 -1.108242  1.233489
2000-01-05 -1.867017 -0.528368 -2.488309  1.480342
2000-01-06  2.569280 -0.471901 -0.835033 -0.532133
2000-01-07 -0.399323 -0.676427 -0.011256  0.223252
2000-01-08  1.642993  1.013420  1.435667 -0.635862
2000-01-09  1.147308  2.138000  0.554171 -0.255538
2000-01-10  0.933766  1.387155 -0.560143 -0.787083

In [51]:
pd.read_csv?

In [59]:
# automatic realignment
atemps - sdtemps

2007-07-16    24.00
2007-07-17    30.67
2007-07-18    -8.25
2007-07-19    35.56
2007-07-20    -4.31
2007-07-21    10.58
Freq: D, dtype: float64

In [60]:
sdtemps1 = sdtemps.drop(sdtemps.index[3])
atemps - sdtemps1

2007-07-16    24.00
2007-07-17    30.67
2007-07-18    -8.25
2007-07-19      NaN
2007-07-20    -4.31
2007-07-21    10.58
dtype: float64

In [65]:
# data alignment happens automatically
temps - temps[:4]

            Austin  Sandiago
2007-07-16       0         0
2007-07-17       0         0
2007-07-18       0         0
2007-07-19       0         0
2007-07-20     NaN       NaN
2007-07-21     NaN       NaN